Al igual que en los ejercicios de pair programming de estadística, deberéis elegir un set de datos, puede ser de cualquier tipo.

El objetivo de este pair programming es:

* Hacer una exploración inicial del dataframe.
* ¿Cuántas filas tiene?
* ¿Cuántas nulos tiene?
* ¿Y duplicados?
* ¿Qué tipo de datos tenemos en el dataframe?
* etc.

In [1]:
import pandas as pd
import numpy as np
import scipy.stats as st

In [2]:
df = pd.read_csv('ds_salaries.csv', index_col =0)

In [3]:
# Comprobamos su forma

df.shape

(607, 11)

In [4]:
# Chequeamos los nulos y no tiene, está muy limpio

df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [5]:
# Exploramos el nombre de sus columnas y el tipo de dato

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    object
 2   employment_type     607 non-null    object
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     607 non-null    object
 6   salary_in_usd       607 non-null    int64
 7   employee_residence  607 non-null    object
 8   remote_ratio        607 non-null    int64
 9   company_location    607 non-null    object
 10  company_size        607 non-null    object
dtypes: int64(4), object(7)
memory usage: 56.9+ KB

In [7]:
# Calculamos los estadísticos generales para categóricas y numericas, ya que tenemos gran cantidad de variables categóricas

df.describe(include = 'all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
work_year,607.0,NaN,NaN,NaN,2021.405272,0.692133,2020.0,2021.0,2022.0,2022.0,2022.0
experience_level,607,4,SE,280,NaN,NaN,NaN,NaN,NaN,NaN,NaN
employment_type,607,4,FT,588,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job_title,607,50,Data Scientist,143,NaN,NaN,NaN,NaN,NaN,NaN,NaN
salary,607.0,NaN,NaN,NaN,324000.062603,1544357.486636,4000.0,70000.0,115000.0,165000.0,30400000.0
salary_currency,607,17,USD,398,NaN,NaN,NaN,NaN,NaN,NaN,NaN
salary_in_usd,607.0,NaN,NaN,NaN,112297.869852,70957.259411,2859.0,62726.0,101570.0,150000.0,600000.0
employee_residence,607,57,US,332,NaN,NaN,NaN,NaN,NaN,NaN,NaN
remote_ratio,607.0,NaN,NaN,NaN,70.92257,40.70913,0.0,50.0,100.0,100.0,100.0
company_location,607,50,US,355,NaN,NaN,NaN,NaN,NaN,NaN,NaN
company_size,607,3,M,326,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
# Exploramos las filas duplicadas

df.duplicated().sum()

42

In [18]:
# Vemos que no hay duplicados de fila completos, solo de algunas columnas. Vamos a comprobar si hay indices duplicados

df[df.duplicated()]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
217,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L
256,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
331,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
332,2022,SE,FT,Data Analyst,112900,USD,112900,US,100,US,M
333,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
353,2022,SE,FT,Data Scientist,123000,USD,123000,US,100,US,M
362,2022,SE,FT,Data Analyst,130000,USD,130000,CA,100,CA,M
363,2022,SE,FT,Data Analyst,61300,USD,61300,CA,100,CA,M
370,2022,SE,FT,Data Scientist,123000,USD,123000,US,100,US,M
374,2022,MI,FT,ETL Developer,50000,EUR,54957,GR,0,GR,M
377,2022,SE,FT,Data Engineer,165400,USD,165400,US,100,US,M
385,2022,SE,FT,Data Engineer,132320,USD,132320,US,100,US,M
392,2022,SE,FT,Data Analyst,112900,USD,112900,US,100,US,M
393,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
406,2022,MI,FT,Data Analyst,58000,USD,58000,US,0,US,S
438,2022,SE,FT,Machine Learning Engineer,189650,USD,189650,US,0,US,M
439,2022,SE,FT,Machine Learning Engineer,164996,USD,164996,US,0,US,M
443,2022,MI,FT,Data Engineer,60000,GBP,78526,GB,100,GB,M
446,2022,SE,FT,Data Engineer,209100,USD,209100,US,100,US,L
447,2022,SE,FT,Data Engineer,154600,USD,154600,US,100,US,L
473,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
527,2022,SE,FT,Data Analyst,135000,USD,135000,US,100,US,M
529,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
536,2022,SE,FT,Data Analyst,112900,USD,112900,US,100,US,M
537,2022,SE,FT,Data Engineer,155000,USD,155000,US,100,US,M
545,2022,SE,FT,Data Engineer,115000,USD,115000,US,100,US,M
547,2022,SE,FT,Data Engineer,130000,USD,130000,US,100,US,M
551,2022,SE,FT,Data Scientist,140400,USD,140400,US,0,US,L
555,2022,SE,FT,Data Engineer,160000,USD,160000,US,100,US,M
566,2022,SE,FT,Data Analyst,170000,USD,170000,US,100,US,M
569,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
571,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
572,2022,SE,FT,Data Analyst,100000,USD,100000,US,100,US,M
574,2022,SE,FT,Data Scientist,210000,USD,210000,US,100,US,M
575,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
576,2022,SE,FT,Data Scientist,210000,USD,210000,US,100,US,M
578,2022,SE,FT,Data Engineer,100000,USD,100000,US,100,US,M
587,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
588,2022,SE,FT,Data Analyst,99000,USD,99000,US,0,US,M
592,2022,SE,FT,Data Scientist,230000,USD,230000,US,100,US,M
596,2022,SE,FT,Data Scientist,210000,USD,210000,US,100,US,M
597,2022,SE,FT,Data Analyst,170000,USD,170000,US,100,US,M

In [16]:
# No hay indices duplicados, por lo que nuestro conjunto de datos está listo para analizar!

df.index.duplicated().sum()

0


* Plantead una serie de preguntas como las que fuimos contestando en la clase invertida.

In [19]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [36]:
# ¿Cuanto se gana segun la experiencia?

df['experience_level']
df['salary_in_usd']

df['rangos_salario'] = pd.cut(df['salary_in_usd'], bins = (2000, 50000, 100000, 200000, 400000, 600000), labels = ['muy bajo', 'bajo', 'medio', 'alto', 'muy alto'])
crosstab = pd.crosstab(df['experience_level'], df['rangos_salario'])
crosstab

rangos_salario    muy bajo  bajo  medio  alto  muy alto
experience_level
EN                      38    40      8     2         0
EX                       0     4     12     8         2
MI                      58    89     60     3         3
SE                      11    62    171    34         2

In [ ]:
## Leyenda: EN - Junior | Entry level ; MI - Middle level | Intermediate ; SE - Senior level | Expert ; EX - Expert level | Director

In [37]:
# ¿Cual es el salario maximo y minimo y la experiencia y puesto de cada uno?

max = df['salary_in_usd'].max()
min = df['salary_in_usd'].min()

In [46]:
print('El salario máximo es', max)
print('------------')
print('El nivel de esta persona es:\n', df[df['salary_in_usd'] == max]['experience_level'].values)

El salario máximo es 600000
------------
El nivel de esta persona es:
 ['EX']

In [48]:
print('El salario mínimo es', min)
print('------------')
print('El nivel de esta persona :\n', df[df['salary_in_usd'] == min]['experience_level'].values)

El salario mínimo es 2859
------------
El nivel de esta persona :
 ['MI']

In [ ]:
# Nos sorprende que una personal con nivel intermedio sea la que cobre el salario mínimo, vamos a comprobar su procedencia y la de su empresa para ver si no es un dato erroneo

In [ ]:
# ¿Qué puesto de trabajo cobra más en USD?

In [ ]:
# Frecuencia de job title y en que paises estan los mas frecuentes
# El nivel de experiencia en el sector data por paises
# ¿Cuántos trabajan de forma remota desde otro pais?
# ¿Con cuanta experiencia trabajan mas en remoto?


* Contestad a las preguntas planteadas usando los principales estadísticos que hemos aprendido y gráficas que mejor se ajusten.